app/controllers/ticket_types_controller.rb

SELECT "ticket_types".* FROM "ticket_types"
---
  def index
    # This works.
    # OPTS:  {:context=>"action-level accepts options"}
    authorize_action_for TicketType, context: "action-level accepts options"
    @ticket_types = TicketType.all